:PROPERTIES:
:ID:       95fc3cfe-4321-4175-b2b0-9a4ed1acff59
:END:
#+TITLE: FRC: Network Tables
#+TAGS:
#+EMAIL:     aionfork@gmail.com
#+DESCRIPTION: notes
#+OPTIONS: ':nil *:t -:t ::t <:t \n:nil ^:t arch:headline
#+OPTIONS: author:nil c:nil d:(not "LOGBOOK") date:nil
#+OPTIONS: e:t email:nil f:t inline:t num:nil p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:nil todo:t |:t
#+OPTIONS: toc:nil
#+OPTIONS: html-style:link
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="FRC-NetworkTables.css" />
# #+BIND: org-html-htmlize-output-type nil
#+SELECT_TAGS:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en

** Types

Some manual editing was required to focus on useful fields

#+name: ascopeNTTypes
#+begin_example
Rotation2d
Rotation2d/value =float=

Translation2d
Translation2d/x =float=
Translation2d/y =float=

Pose2d
Pose2d/rotation =Rotation2d=
Pose2d/translation =Translation2d=

ChassisSpeeds
ChassisSpeeds/Measured/omega
ChassisSpeeds/Measured/vx
ChassisSpeeds/Measured/vy
ChassisSpeeds/Setpoints/omega
ChassisSpeeds/Setpoints/vx
ChassisSpeeds/Setpoints/vy

SwerveModuleState[]
SwerveModuleState[]/0
SwerveModuleState[]/1
SwerveModuleState[]/2
SwerveModuleState[]/3
SwerveModuleState[]/3/speed =float=
SwerveModuleState[]/3/angle =Rotation2d=
#+end_example

#+begin_src shell :stdin ascopeNTTypes :results output verbatim
tree --noreport --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
├── ChassisSpeeds
│   ├── Measured
│   │   ├── omega
│   │   ├── vx
│   │   └── vy
│   └── Setpoints
│       ├── omega
│       ├── vx
│       └── vy
├── Pose2d
│   ├── rotation =Rotation2d=
│   └── translation =Translation2d=
└── SwerveModuleState[]
    ├── 0
    ├── 1
    ├── 2
    └── 3
        ├── angle
        │   └── valeu
        └── speed
#+end_example

